In [28]:
import pandas as pd
import random
from sklearn.preprocessing import MinMaxScaler, StandardScaler

### Creating a dummy dataset with 10 rows and 2 columns (person's age (column1) and salary (column2))

In [16]:
def create_dummy_dataset(num_rows=10):
    age_list = [random.randint(10, 80) for _ in range(num_rows)]
    salary_list = [random.randint(1000, 1000000) for _ in range(num_rows)]

    return pd.DataFrame({
        'age': age_list,
        'salary': salary_list
    })

data = create_dummy_dataset()

In [17]:
data

   age  salary
0   46  213062
1   51  256165
2   51  958058
3   57  742781
4   24  425525
5   45   21914
6   52  291351
7   42  902356
8   44  887411
9   17  511946

In [19]:
data.describe()

            age         salary
count  10.00000      10.000000
mean   42.90000  521056.900000
std    12.72312  332646.330844
min    17.00000   21914.000000
25%    42.50000  264961.500000
50%    45.50000  468735.500000
75%    51.00000  851253.500000
max    57.00000  958058.000000

### Lets apply normalisation

In [14]:
scaler = MinMaxScaler()

In [20]:
scaler.fit(data)

MinMaxScaler()

In [56]:
print(scaler.data_min_)
print(scaler.data_max_)

[1.7000e+01 2.1914e+04]
[5.70000e+01 9.58058e+05]

In [55]:
print("scaler.data_max and scaler.data_min_ give you the max and min respectively for each of the columns ==>", scaler.data_min_)
scaled_numpy_array = scaler.transform(data)
print(scaled_numpy_array)

scaler.data_max and scaler.data_min_ give you the max and min respectively for each of the columns ==> [1.7000e+01 2.1914e+04]
[[0.725      0.20418654]
 [0.85       0.25022967]
 [0.85       1.        ]
 [1.         0.77003858]
 [0.175      0.431142  ]
 [0.7        0.        ]
 [0.875      0.28781576]
 [0.625      0.94049847]
 [0.675      0.92453405]
 [0.         0.52345793]]

### Convert this back to a dataframe

In [23]:
columns = data.columns
scaled_df = pd.DataFrame(scaled_numpy_array, columns=columns)

In [24]:
scaled_df

     age    salary
0  0.725  0.204187
1  0.850  0.250230
2  0.850  1.000000
3  1.000  0.770039
4  0.175  0.431142
5  0.700  0.000000
6  0.875  0.287816
7  0.625  0.940498
8  0.675  0.924534
9  0.000  0.523458

In [25]:
scaled_df.describe()

             age     salary
count  10.000000  10.000000
mean    0.647500   0.533190
std     0.318078   0.355337
min     0.000000   0.000000
25%     0.637500   0.259626
50%     0.712500   0.477300
75%     0.850000   0.885910
max     1.000000   1.000000